InformationRegisters/ПорядокУплатыНалоговНаМестах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПорядокУплатыНалоговНаМестах</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокУплатыНалогаМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУплатыНалогаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УплачиваютсяАвансы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУплатыАвансаМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУплатыАвансаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУплатыУстанавливаетсяДляКаждогоАванса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУплатыАванса1КвМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУплатыАванса1КвДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУплатыАванса2КвМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУплатыАванса2КвДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУплатыАванса3КвМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУплатыАванса3КвДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиБухгалтера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПрекращенияПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвижимоеИмуществоПодлежащееНалогообложению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляВПравеОбщейСобственностиЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляВПравеОбщейСобственностиЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощадиЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощадиЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСтоимостиЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСтоимостиЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастроваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастровыйНомерПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаИмущества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНалоговойЛьготыОсвобождениеОтНалогообложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяБаза</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НалоговаяБазаПоНалогуНаИмущество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеоблагаемаяКадастроваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокНалогообложенияИмущества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостановкаНаУчетВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПостановкаНаУчетВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СниженнаяНалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидИмущества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьВидыИмущества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВходитВСоставЕСГС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРасположенВРазныхСубъектахФедерации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПостановкаНаУчетВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ПостановкаНаУчетВНалоговомОргане</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоМестуНахожденияОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДругимКодомПоОКАТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВДругомНалоговомОргане</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДействийКалендаряБухгалтера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыДействийКалендаряБухгалтера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярныйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПорядокУплатыНалоговНаМестах/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НалогиПорядокКоторыхУстанавливаетсяНаМестах() Экспорт
	
	Налоги = КодыНалоговПорядокКоторыхУстанавливаетсяНаМестах();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Налоги", Налоги);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиБухгалтера.Ссылка
	|ИЗ
	|	Справочник.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Код В(&Налоги)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция определяет, по каким из имущественных налогов, есть действующие настройки уплаты авансовых платежей
//
// Параметры:
//  Организация	 - СправочникСсылка.Организация	- организация, по которой выполняется поиск настроек
//  Период		 - Дата	- дата, на клоторую выбираются действующие настройки
// 
// Возвращаемое значение:
//   - Массив - массив строк с идентификаторами налогов в справочнике задач бухгалтера
//
Функция НалогиСНастройкамиАвансов(Организация, Период) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Налог.Код КАК ИдентификаторЗадачи
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(&Период, Организация = &Организация) КАК ПорядокУплатыНалоговНаМестахСрезПоследних
	|ГДЕ
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.УплачиваютсяАвансы";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторЗадачи");
				
КонецФункции

Процедура СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(МенеджерВременныхТаблиц, СписокОрганизаций, Период, Налог) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Налог", Налог);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Налог КАК Налог,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.РегистрацияВНалоговомОргане КАК НалоговыйОрган,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ПорядокУплаты
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(&Период, Организация В (&СписокОрганизаций)) КАК ПорядокУплатыНалоговНаМестахСрезПоследних
	|ГДЕ
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.УплачиваютсяАвансы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Налог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПорядокУплаты.НалоговыйОрган КАК НалоговыйОрган,
	|	ВТ_ПорядокУплаты.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов
	|ИЗ
	|	ВТ_ПорядокУплаты КАК ВТ_ПорядокУплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|		ПО ВТ_ПорядокУплаты.Налог = ЗадачиБухгалтера.Ссылка
	|			И (ЗадачиБухгалтера.Код = &Налог)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НалоговыйОрган,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПорядокУплаты";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьМестныеНалогиВРазрезеНалоговыхОрганов(МенеджерВременныхТаблиц, Организация, ТекущийПериод = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	НачалоПериода = НачалоГода(ДобавитьМесяц(ТекущаяДатаСеанса(), -3)) - 1;
	КонецПериода = КонецГода(ТекущаяДатаСеанса());
	
	УсловияИсключения = Перечисления.УсловияПримененияТребованийЗаконодательства.УсловияИсключенияПоТипуОрганизации(Организация, ТекущийПериод);
	
	Запрос.УстановитьПараметр("НачалоПериода",     НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",      КонецПериода);
	Запрос.УстановитьПараметр("Организация",       Организация);
	Запрос.УстановитьПараметр("НалогНаИмущество",  "НалогНаИмущество");
	Запрос.УстановитьПараметр("ЗемельныйНалог",    "ЗемельныйНалог");
	Запрос.УстановитьПараметр("ТранспортныйНалог", "ТранспортныйНалог");
	Запрос.УстановитьПараметр("УсловияИсключения", УсловияИсключения);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиБухгалтера.Код КАК Налог,
	|	ЗадачиБухгалтера.Ссылка КАК Задача
	|ПОМЕСТИТЬ НалогиНаМестах
	|ИЗ
	|	Справочник.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Код В (&НалогНаИмущество, &ЗемельныйНалог, &ТранспортныйНалог)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Налог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка КАК Правило,
	|	ПравилаПредставленияОтчетовУплатыНалогов.Владелец КАК Задача,
	|	НалогиНаМестах.Налог КАК Налог
	|ПОМЕСТИТЬ ВсеПравилаНалога
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ПравилаПредставленияОтчетовУплатыНалогов
	|		ЛЕВОЕ СОЕДИНЕНИЕ НалогиНаМестах КАК НалогиНаМестах
	|		ПО ПравилаПредставленияОтчетовУплатыНалогов.Владелец = НалогиНаМестах.Задача
	|ГДЕ
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка.Владелец В
	|			(ВЫБРАТЬ
	|				НалогиНаМестах.Задача
	|			ИЗ
	|				НалогиНаМестах)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка,
	|	ПравилаПредставленияОтчетовУплатыНалогов.Владелец,
	|	НалогиНаМестах.Налог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПравилаПредставленияОтчетовУплатыНалоговУсловия.Ссылка КАК Правило,
	|	ПравилаПредставленияОтчетовУплатыНалоговУсловия.Ссылка.Владелец КАК Задача,
	|	НалогиНаМестах.Налог КАК Налог
	|ПОМЕСТИТЬ ПравилаИсключения
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов.Условия КАК ПравилаПредставленияОтчетовУплатыНалоговУсловия
	|		ЛЕВОЕ СОЕДИНЕНИЕ НалогиНаМестах КАК НалогиНаМестах
	|		ПО ПравилаПредставленияОтчетовУплатыНалоговУсловия.Ссылка.Владелец = НалогиНаМестах.Задача
	|ГДЕ
	|	ПравилаПредставленияОтчетовУплатыНалоговУсловия.Условие В(&УсловияИсключения)
	|	И ПравилаПредставленияОтчетовУплатыНалоговУсловия.Ссылка.Владелец В
	|			(ВЫБРАТЬ
	|				НалогиНаМестах.Задача
	|			ИЗ
	|				НалогиНаМестах)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПравилаПредставленияОтчетовУплатыНалоговУсловия.Ссылка,
	|	ПравилаПредставленияОтчетовУплатыНалоговУсловия.Ссылка.Владелец,
	|	НалогиНаМестах.Налог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПравилаНалога.Задача КАК Задача,
	|	ВсеПравилаНалога.Налог КАК Налог
	|ПОМЕСТИТЬ ДоступныеНалогиНаМестах
	|ИЗ
	|	ВсеПравилаНалога КАК ВсеПравилаНалога
	|ГДЕ
	|	НЕ ВсеПравилаНалога.Задача В
	|				(ВЫБРАТЬ
	|					ПравилаИсключения.Задача КАК ПравилаИсключения
	|				ИЗ
	|					ПравилаИсключения)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеПравилаНалога.Задача,
	|	ВсеПравилаНалога.Налог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НалогНаИмущество КАК Налог,
	|	ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ПоМестуНахожденияОрганизации) КАК ПостановкаНаУчетВНалоговомОргане,
	|	ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка) КАК НалоговыйОрган
	|ПОМЕСТИТЬ НалоговыеОрганы
	|ГДЕ
	|	&НалогНаИмущество В
	|			(ВЫБРАТЬ
	|				ДоступныеНалогиНаМестах.Налог
	|			ИЗ
	|				ДоступныеНалогиНаМестах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НалогНаИмущество,
	|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане,
	|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговыйОрган
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
	|ГДЕ
	|	&НалогНаИмущество В
	|			(ВЫБРАТЬ
	|				ДоступныеНалогиНаМестах.Налог
	|			ИЗ
	|				ДоступныеНалогиНаМестах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НалогНаИмущество,
	|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ПостановкаНаУчетВНалоговомОргане,
	|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговыйОрган
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
	|ГДЕ
	|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация = &Организация
	|	И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И &НалогНаИмущество В
	|			(ВЫБРАТЬ
	|				ДоступныеНалогиНаМестах.Налог
	|			ИЗ
	|				ДоступныеНалогиНаМестах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ЗемельныйНалог,
	|	ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ПоМестуНахожденияОрганизации),
	|	ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|ГДЕ
	|	&НалогНаИмущество В
	|			(ВЫБРАТЬ
	|				ДоступныеНалогиНаМестах.Налог
	|			ИЗ
	|				ДоступныеНалогиНаМестах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ЗемельныйНалог,
	|	РегистрацияЗемельныхУчастковСрезПоследних.ПостановкаНаУчетВНалоговомОргане,
	|	РегистрацияЗемельныхУчастковСрезПоследних.НалоговыйОрган
	|ИЗ
	|	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&КонецПериода, Организация = &Организация) КАК РегистрацияЗемельныхУчастковСрезПоследних
	|ГДЕ
	|	РегистрацияЗемельныхУчастковСрезПоследних.ВключатьВНалоговуюБазу = ИСТИНА
	|	И &ЗемельныйНалог В
	|			(ВЫБРАТЬ
	|				ДоступныеНалогиНаМестах.Налог
	|			ИЗ
	|				ДоступныеНалогиНаМестах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ЗемельныйНалог,
	|	РегистрацияЗемельныхУчастков.ПостановкаНаУчетВНалоговомОргане,
	|	РегистрацияЗемельныхУчастков.НалоговыйОрган
	|ИЗ
	|	РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
	|ГДЕ
	|	РегистрацияЗемельныхУчастков.Организация = &Организация
	|	И РегистрацияЗемельныхУчастков.ВключатьВНалоговуюБазу = ИСТИНА
	|	И РегистрацияЗемельныхУчастков.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И &ЗемельныйНалог В
	|			(ВЫБРАТЬ
	|				ДоступныеНалогиНаМестах.Налог
	|			ИЗ
	|				ДоступныеНалогиНаМестах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ТранспортныйНалог,
	|	ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ПоМестуНахожденияОрганизации),
	|	ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|ГДЕ
	|	&НалогНаИмущество В
	|			(ВЫБРАТЬ
	|				ДоступныеНалогиНаМестах.Налог
	|			ИЗ
	|				ДоступныеНалогиНаМестах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ТранспортныйНалог,
	|	РегистрацияТранспортныхСредствСрезПоследних.ПостановкаНаУчетВНалоговомОргане,
	|	РегистрацияТранспортныхСредствСрезПоследних.НалоговыйОрган
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств.СрезПоследних(&КонецПериода, Организация = &Организация) КАК РегистрацияТранспортныхСредствСрезПоследних
	|ГДЕ
	|	РегистрацияТранспортныхСредствСрезПоследних.ВключатьВНалоговуюБазу = ИСТИНА
	|	И &ТранспортныйНалог В
	|			(ВЫБРАТЬ
	|				ДоступныеНалогиНаМестах.Налог
	|			ИЗ
	|				ДоступныеНалогиНаМестах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ТранспортныйНалог,
	|	РегистрацияТранспортныхСредств.ПостановкаНаУчетВНалоговомОргане,
	|	РегистрацияТранспортныхСредств.НалоговыйОрган
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
	|ГДЕ
	|	РегистрацияТранспортныхСредств.Организация = &Организация
	|	И РегистрацияТранспортныхСредств.ВключатьВНалоговуюБазу = ИСТИНА
	|	И РегистрацияТранспортныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И &ТранспортныйНалог В
	|			(ВЫБРАТЬ
	|				ДоступныеНалогиНаМестах.Налог
	|			ИЗ
	|				ДоступныеНалогиНаМестах)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Налог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиНаМестах.Задача КАК Налог,
	|	ВЫБОР
	|		КОГДА НалоговыеОрганы.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
	|			ТОГДА НалоговыеОрганы.НалоговыйОрган
	|		ИНАЧЕ Организации.РегистрацияВНалоговомОргане
	|	КОНЕЦ КАК НалоговыйОрган
	|ПОМЕСТИТЬ МестныеНалогиВРазрезеНалоговыхОрганов
	|ИЗ
	|	НалогиНаМестах КАК НалогиНаМестах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НалоговыеОрганы КАК НалоговыеОрганы
	|		ПО НалогиНаМестах.Налог = НалоговыеОрганы.Налог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО (Организации.Ссылка = &Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Налог,
	|	НалоговыйОрган
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НалогиНаМестах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НалоговыеОрганы";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПорядокУплатыРегиональныхМестныхНалогов(Организация, Период) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.ПорядокУплатыНалоговНаМестах;
	
	ПорядокУплаты = Новый ТаблицаЗначений;
	ПорядокУплаты.Колонки.Добавить("Период",                      Новый ОписаниеТипов("Дата"));
	ПорядокУплаты.Колонки.Добавить("Налог",                       МетаданныеРегистра.Измерения.Налог.Тип);
	ПорядокУплаты.Колонки.Добавить("РегистрацияВНалоговомОргане", МетаданныеРегистра.Измерения.РегистрацияВНалоговомОргане.Тип);
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		ПорядокУплаты.Колонки.Добавить(Ресурс.Имя, Ресурс.Тип);
	КонецЦикла;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; // Хранит МестныеНалогиВРазрезеНалоговыхОрганов
	СоздатьМестныеНалогиВРазрезеНалоговыхОрганов(МенеджерВременныхТаблиц, Организация);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("Период",              Период);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокУплатыНалоговНаМестах.Период КАК Период,
	|	ПорядокУплатыНалоговНаМестах.Налог КАК Налог,
	|	ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане КАК НалоговыйОрган,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыНалогаМесяцев,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыНалогаДней,
	|	ПорядокУплатыНалоговНаМестах.УплачиваютсяАвансы,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыАвансаМесяцев,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыАвансаДней,
	|	ПорядокУплатыНалоговНаМестах.Описание
	|ПОМЕСТИТЬ ПравилаЗаданыПользователем
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(&Период, Организация = &Организация) КАК ПорядокУплатыНалоговНаМестах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Налог,
	|	НалоговыйОрган
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МестныеНалогиВРазрезеНалоговыхОрганов.Налог КАК Налог,
	|	МестныеНалогиВРазрезеНалоговыхОрганов.НалоговыйОрган
	|ПОМЕСТИТЬ НалогиПоФедеральнымПравилам
	|ИЗ
	|	МестныеНалогиВРазрезеНалоговыхОрганов КАК МестныеНалогиВРазрезеНалоговыхОрганов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПравилаЗаданыПользователем КАК ПравилаЗаданыПользователем
	|		ПО МестныеНалогиВРазрезеНалоговыхОрганов.Налог = ПравилаЗаданыПользователем.Налог
	|			И МестныеНалогиВРазрезеНалоговыхОрганов.НалоговыйОрган = ПравилаЗаданыПользователем.НалоговыйОрган
	|ГДЕ
	|	ПравилаЗаданыПользователем.Налог ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Налог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПравилаЗаданыПользователем.Период КАК Период,
	|	МестныеНалогиВРазрезеНалоговыхОрганов.Налог КАК Налог,
	|	МестныеНалогиВРазрезеНалоговыхОрганов.НалоговыйОрган КАК РегистрацияВНалоговомОргане,
	|	ПравилаЗаданыПользователем.СрокУплатыНалогаМесяцев,
	|	ПравилаЗаданыПользователем.СрокУплатыНалогаДней,
	|	ПравилаЗаданыПользователем.УплачиваютсяАвансы,
	|	ПравилаЗаданыПользователем.СрокУплатыАвансаМесяцев,
	|	ПравилаЗаданыПользователем.СрокУплатыАвансаДней,
	|	ПравилаЗаданыПользователем.Описание
	|ИЗ
	|	МестныеНалогиВРазрезеНалоговыхОрганов КАК МестныеНалогиВРазрезеНалоговыхОрганов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПравилаЗаданыПользователем КАК ПравилаЗаданыПользователем
	|		ПО МестныеНалогиВРазрезеНалоговыхОрганов.Налог = ПравилаЗаданыПользователем.Налог
	|			И МестныеНалогиВРазрезеНалоговыхОрганов.НалоговыйОрган = ПравилаЗаданыПользователем.НалоговыйОрган
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалогиПоФедеральнымПравилам.Налог КАК Налог,
	|	НалогиПоФедеральнымПравилам.НалоговыйОрган КАК РегистрацияВНалоговомОргане,
	|	ВЫБОР
	|		КОГДА ПравилаПредставленияОтчетовУплатыНалогов.ФинансовыйПериод = ПравилаПредставленияОтчетовУплатыНалогов.Периодичность
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Аванс,
	|	ПравилаПредставленияОтчетовУплатыНалогов.СрокМесяцев,
	|	ПравилаПредставленияОтчетовУплатыНалогов.СрокДней
	|ИЗ
	|	НалогиПоФедеральнымПравилам КАК НалогиПоФедеральнымПравилам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ПравилаПредставленияОтчетовУплатыНалогов
	|		ПО НалогиПоФедеральнымПравилам.Налог = ПравилаПредставленияОтчетовУплатыНалогов.Владелец
	|ГДЕ
	|	ПравилаПредставленияОтчетовУплатыНалогов.НачалоДействия <= &Период
	|	И (ПравилаПредставленияОтчетовУплатыНалогов.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ПравилаПредставленияОтчетовУплатыНалогов.КонецДействия >= &Период)
	|	И НЕ ПравилаПредставленияОтчетовУплатыНалогов.ПометкаУдаления
	|	И ПравилаПредставленияОтчетовУплатыНалогов.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка
	|ИТОГИ ПО
	|	Налог,
	|	РегистрацияВНалоговомОргане,
	|	Аванс";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Правила, заданные пользователем
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПорядокУплаты.Добавить(), Выборка);
	КонецЦикла;
	
	// Значения по умолчанию
	ВыборкаНалоги = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНалоги.Следующий() Цикл
		
		ВыборкаРегистрацияВНалоговомОргане = ВыборкаНалоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРегистрацияВНалоговомОргане.Следующий() Цикл
		
			НоваяСтрока = ПорядокУплаты.Добавить();
			НоваяСтрока.Период = НачалоГода(ТекущаяДатаСеанса());
			НоваяСтрока.Налог  = ВыборкаНалоги.Налог;
			НоваяСтрока.УплачиваютсяАвансы = Ложь;
			НоваяСтрока.РегистрацияВНалоговомОргане = ВыборкаРегистрацияВНалоговомОргане.РегистрацияВНалоговомОргане;
			
			ВыборкаАванс = ВыборкаРегистрацияВНалоговомОргане.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаАванс.Следующий() Цикл
				
				Выборка = ВыборкаАванс.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.Аванс Тогда
						НоваяСтрока.СрокУплатыАвансаМесяцев = Выборка.СрокМесяцев;
						НоваяСтрока.СрокУплатыАвансаДней    = Выборка.СрокДней;
					Иначе
						НоваяСтрока.СрокУплатыНалогаМесяцев = Выборка.СрокМесяцев;
						НоваяСтрока.СрокУплатыНалогаДней    = Выборка.СрокДней;
					КонецЕсли;
					УстановитьОписание(НоваяСтрока);
					Прервать;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПорядокУплаты;
	
КонецФункции

Процедура УстановитьОписание(Запись) Экспорт
	
	День = 24 * 60 * 60;
	
	Описание = Новый Массив;
	
	Если Запись.СрокУплатыНалогаМесяцев = 0 И Запись.СрокУплатыНалогаДней = 0 Тогда
		СрокУплатыНалога = НСтр("ru = 'Срок уплаты налога не установлен'");
	ИначеЕсли Запись.СрокУплатыНалогаМесяцев = 0 И Запись.СрокУплатыНалогаДней > 31 Тогда
		СрокУплатыНалога = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Срок уплаты налога - %1'"),
			СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(Запись.СрокУплатыНалогаДней, "день,дня,дней"));
	Иначе
		Дата = ДобавитьМесяц('20000101', Запись.СрокУплатыНалогаМесяцев) + Запись.СрокУплатыНалогаДней * День - 1;
		СрокУплатыНалога = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Срок уплаты налога - %1'"),
			Формат(Дата, "ДФ='dd MMMM'"));
	КонецЕсли;
	Описание.Добавить(СрокУплатыНалога);
	
	Если Не Запись.УплачиваютсяАвансы Тогда
		СрокУплатыАванса = НСтр("ru = 'Авансы не уплачиваются'");
	ИначеЕсли НЕ Запись.СрокУплатыУстанавливаетсяДляКаждогоАванса Тогда
		
		Если Запись.СрокУплатыАвансаМесяцев = 0 Тогда
			СтрокаСрокУплатыАвансаМесяцев = НСтр("");
		Иначе
			СтрокаСрокУплатыАвансаМесяцев = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				Запись.СрокУплатыАвансаМесяцев, 
				НСтр("ru = 'месяц,месяца,месяцев'"));
		КонецЕсли;
		
		Если Запись.СрокУплатыАвансаДней = 0 Тогда
			СтрокаСрокУплатыАвансаДней = НСтр("");
		Иначе
			СтрокаСрокУплатыАвансаДней = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				Запись.СрокУплатыАвансаДней, 
				НСтр("ru = 'день,дня,дней'"));
		КонецЕсли;
		
		СрокУплатыАванса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			СокрП(НСтр("ru = 'Срок уплаты авансов - %1 %2'")),
			СтрокаСрокУплатыАвансаМесяцев,
			СтрокаСрокУплатыАвансаДней);
	Иначе
			
		СрокУплатыАванса1Кв = СрокУплатыАвансаЗаКвартал(Запись, 1);
		СрокУплатыАванса2Кв = СрокУплатыАвансаЗаКвартал(Запись, 2);
		СрокУплатыАванса3Кв = СрокУплатыАвансаЗаКвартал(Запись, 3);
		
		СрокУплатыАванса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			СокрП(НСтр("ru = 'Срок уплаты авансов - %1, %2, %3'")),
			Формат(СрокУплатыАванса1Кв, "ДФ='dd MMMM'"),
			Формат(СрокУплатыАванса2Кв, "ДФ='dd MMMM'"),
			Формат(СрокУплатыАванса3Кв, "ДФ='dd MMMM'"));
			
	КонецЕсли;
		
	Описание.Добавить(СрокУплатыАванса);
	
	Запись.Описание = СтрСоединить(Описание, "; ");
	
КонецПроцедуры

Процедура СоздатьПравилаУплатыНалоговНаМестах(МенеджерВременныхТаблиц, Организация, ИмяЗадачиУплатыНалога = "", ТекущийПериод = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяЗадачиУплатыНалога) Тогда
		КодыНалоговПорядокКоторыхУстанавливаетсяНаМестах = КодыНалоговПорядокКоторыхУстанавливаетсяНаМестах();
		Если КодыНалоговПорядокКоторыхУстанавливаетсяНаМестах.Найти(ИмяЗадачиУплатыНалога) = Неопределено Тогда
			// Создадим пустую таблицу
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Справочник.ПравилаПредставленияОтчетовУплатыНалогов.ПустаяСсылка) КАК Правило,
			|	ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка) КАК РегистрацияВНалоговомОргане,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодДействияПравила,
			|	ИСТИНА КАК Включено,
			|	0 КАК СрокМесяцев,
			|	0 КАК СрокДней,
			|	"""" КАК ОграничениеПериода
			|ПОМЕСТИТЬ ПравилаУплатыНалоговНаМестах
			|ГДЕ
			|	ЛОЖЬ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Правило,
			|	ПериодДействияПравила";
			Запрос.Выполнить();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Сохраним список тех временных таблиц, которые были в менеджере, -
	// ниже из менеджера удалим все временные талицы кроме указанных в этом списке.
	// Иными словами, ниже почистим все "промежуточные" временные таблицы, которые использованы в этой процедуре.
	НеудаляемыеВременныеТаблицы = ОбщегоНазначенияБП.СписокВременныхТаблиц(МенеджерВременныхТаблиц);
	
	СоздатьМестныеНалогиВРазрезеНалоговыхОрганов(МенеджерВременныхТаблиц, Организация, ТекущийПериод);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилаПредставленияОтчетовУплатыНалогов.Владелец КАК Налог,
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка КАК Ссылка,
	|	ПравилаПредставленияОтчетовУплатыНалогов.ФинансовыйПериод КАК ФинансовыйПериод,
	|	ПравилаПредставленияОтчетовУплатыНалогов.Периодичность КАК Периодичность,
	|	ПравилаПредставленияОтчетовУплатыНалогов.Действие КАК Действие,
	|	ПравилаПредставленияОтчетовУплатыНалогов.СрокМесяцев КАК СрокМесяцев,
	|	ПравилаПредставленияОтчетовУплатыНалогов.СрокДней КАК СрокДней,
	|	МестныеНалогиВРазрезеНалоговыхОрганов.НалоговыйОрган КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ Правила
	|ИЗ
	|	МестныеНалогиВРазрезеНалоговыхОрганов КАК МестныеНалогиВРазрезеНалоговыхОрганов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ПравилаПредставленияОтчетовУплатыНалогов
	|		ПО МестныеНалогиВРазрезеНалоговыхОрганов.Налог = ПравилаПредставленияОтчетовУплатыНалогов.Владелец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистрацияВНалоговомОргане,
	|	Налог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Правила.Налог КАК Налог,
	|	Правила.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ОтборПравил
	|ИЗ
	|	Правила КАК Правила
	|ГДЕ
	|	Правила.ФинансовыйПериод <> Правила.Периодичность
	|	И Правила.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Налог,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПорядокУплатыНалоговНаМестах.Налог КАК Налог,
	|	ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ПорядокУплатыНалоговНаМестах.Период КАК Период,
	|	ПорядокУплатыНалоговНаМестах.УплачиваютсяАвансы КАК УплачиваютсяАвансы,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыАвансаМесяцев КАК СрокУплатыАвансаМесяцев,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыАвансаДней КАК СрокУплатыАвансаДней,
	|	""4"" КАК ОграничениеПериода
	|ПОМЕСТИТЬ МестныеПравилаУплатыАвансов
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах КАК ПорядокУплатыНалоговНаМестах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборПравил КАК ОтборПравил
	|		ПО ПорядокУплатыНалоговНаМестах.Налог = ОтборПравил.Налог
	|			И ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане = ОтборПравил.РегистрацияВНалоговомОргане
	|ГДЕ
	|	ПорядокУплатыНалоговНаМестах.Организация = &Организация
	|	И НЕ ПорядокУплатыНалоговНаМестах.СрокУплатыУстанавливаетсяДляКаждогоАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорядокУплатыНалоговНаМестах.Налог,
	|	ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане,
	|	ПорядокУплатыНалоговНаМестах.Период,
	|	ИСТИНА,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыАванса1КвМесяцев,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыАванса1КвДней,
	|	""2,3,4""
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах КАК ПорядокУплатыНалоговНаМестах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборПравил КАК ОтборПравил
	|		ПО ПорядокУплатыНалоговНаМестах.Налог = ОтборПравил.Налог
	|			И ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане = ОтборПравил.РегистрацияВНалоговомОргане
	|ГДЕ
	|	ПорядокУплатыНалоговНаМестах.Организация = &Организация
	|	И ПорядокУплатыНалоговНаМестах.УплачиваютсяАвансы
	|	И ПорядокУплатыНалоговНаМестах.СрокУплатыУстанавливаетсяДляКаждогоАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорядокУплатыНалоговНаМестах.Налог,
	|	ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане,
	|	ПорядокУплатыНалоговНаМестах.Период,
	|	ИСТИНА,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыАванса2КвМесяцев,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыАванса2КвДней,
	|	""1,3,4""
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах КАК ПорядокУплатыНалоговНаМестах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборПравил КАК ОтборПравил
	|		ПО ПорядокУплатыНалоговНаМестах.Налог = ОтборПравил.Налог
	|			И ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане = ОтборПравил.РегистрацияВНалоговомОргане
	|ГДЕ
	|	ПорядокУплатыНалоговНаМестах.Организация = &Организация
	|	И ПорядокУплатыНалоговНаМестах.УплачиваютсяАвансы
	|	И ПорядокУплатыНалоговНаМестах.СрокУплатыУстанавливаетсяДляКаждогоАванса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорядокУплатыНалоговНаМестах.Налог,
	|	ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане,
	|	ПорядокУплатыНалоговНаМестах.Период,
	|	ИСТИНА,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыАванса3КвМесяцев,
	|	ПорядокУплатыНалоговНаМестах.СрокУплатыАванса3КвДней,
	|	""1,2,4""
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах КАК ПорядокУплатыНалоговНаМестах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборПравил КАК ОтборПравил
	|		ПО ПорядокУплатыНалоговНаМестах.Налог = ОтборПравил.Налог
	|			И ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане = ОтборПравил.РегистрацияВНалоговомОргане
	|ГДЕ
	|	ПорядокУплатыНалоговНаМестах.Организация = &Организация
	|	И ПорядокУплатыНалоговНаМестах.УплачиваютсяАвансы
	|	И ПорядокУплатыНалоговНаМестах.СрокУплатыУстанавливаетсяДляКаждогоАванса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Правила.Налог КАК Налог,
	|	Правила.Ссылка КАК Правило,
	|	Правила.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ЕСТЬNULL(ПорядокУплатыНалоговНаМестах.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодДействияПравила,
	|	ЕСТЬNULL(ПорядокУплатыНалоговНаМестах.УплачиваютсяАвансы, ЛОЖЬ) КАК Включено,
	|	ЕСТЬNULL(ПорядокУплатыНалоговНаМестах.СрокУплатыАвансаМесяцев, Правила.СрокМесяцев) КАК СрокМесяцев,
	|	ЕСТЬNULL(ПорядокУплатыНалоговНаМестах.СрокУплатыАвансаДней, Правила.СрокДней) КАК СрокДней,
	|	ПорядокУплатыНалоговНаМестах.ОграничениеПериода КАК ОграничениеПериода
	|ПОМЕСТИТЬ ПравилаУплатыАвансов
	|ИЗ
	|	Правила КАК Правила
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестныеПравилаУплатыАвансов КАК ПорядокУплатыНалоговНаМестах
	|		ПО Правила.РегистрацияВНалоговомОргане = ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане
	|			И Правила.Налог = ПорядокУплатыНалоговНаМестах.Налог
	|ГДЕ
	|	Правила.ФинансовыйПериод <> Правила.Периодичность";
	
	Запрос.Выполнить();
	
	// Учтем особенности некоторых налогов на местах.
	
	// Создает временную таблицу ПравилаПодачиЗаявленияОЛьготеПоТранспортномуЗемельномуНалогу - 
	// она содержит правила, которые будут добавлены в итоговую временную таблицу ПравилаУплатыНалоговНаМестах (см. ниже) 
	СоздатьПравилаПодачиЗаявленияОЛьготеПоТранспортномуЗемельномуНалогу(МенеджерВременныхТаблиц);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Правила.Ссылка КАК Правило,
	|	Правила.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ЕСТЬNULL(ПорядокУплатыНалоговНаМестах.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодДействияПравила,
	|	ИСТИНА КАК Включено,
	|	ВЫБОР
	|		КОГДА Правила.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|			ТОГДА ЕСТЬNULL(ПорядокУплатыНалоговНаМестах.СрокУплатыНалогаМесяцев, Правила.СрокМесяцев)
	|		ИНАЧЕ Правила.СрокМесяцев
	|	КОНЕЦ КАК СрокМесяцев,
	|	ВЫБОР
	|		КОГДА Правила.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|			ТОГДА ЕСТЬNULL(ПорядокУплатыНалоговНаМестах.СрокУплатыНалогаДней, Правила.СрокДней)
	|		ИНАЧЕ Правила.СрокДней
	|	КОНЕЦ КАК СрокДней,
	|	NULL КАК ОграничениеПериода
	|ПОМЕСТИТЬ ПравилаУплатыНалоговНаМестах
	|ИЗ
	|	Правила КАК Правила
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУплатыНалоговНаМестах КАК ПорядокУплатыНалоговНаМестах
	|		ПО Правила.РегистрацияВНалоговомОргане = ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане
	|			И Правила.Налог = ПорядокУплатыНалоговНаМестах.Налог
	|			И (ПорядокУплатыНалоговНаМестах.Организация = &Организация)
	|ГДЕ
	|	Правила.ФинансовыйПериод = Правила.Периодичность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПравилаУплатыАвансов.Правило,
	|	ПравилаУплатыАвансов.РегистрацияВНалоговомОргане,
	|	ПравилаУплатыАвансов.ПериодДействияПравила,
	|	ПравилаУплатыАвансов.Включено,
	|	ПравилаУплатыАвансов.СрокМесяцев,
	|	ПравилаУплатыАвансов.СрокДней,
	|	ПравилаУплатыАвансов.ОграничениеПериода
	|ИЗ
	|	ПравилаУплатыАвансов КАК ПравилаУплатыАвансов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Правила.Правило,
	|	ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка),
	|	Правила.ПериодДействияПравила,
	|	Правила.Включено,
	|	Правила.СрокМесяцев,
	|	Правила.СрокДней,
	|	NULL
	|ИЗ
	|	ПравилаПодачиЗаявленияОЛьготеПоТранспортномуЗемельномуНалогу КАК Правила
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правило,
	|	ПериодДействияПравила";
		
	Запрос.Выполнить();
	
	НеудаляемыеВременныеТаблицы.Добавить("ПравилаУплатыНалоговНаМестах");
	ОбщегоНазначенияБП.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц,, НеудаляемыеВременныеТаблицы);
	
КонецПроцедуры

Процедура СоздатьПравилаПодачиЗаявленияОЛьготеПоТранспортномуЗемельномуНалогу(МенеджерВременныхТаблиц)
	
	// Если организация уплачивает авансы по транспортному или земельному налогу хотя бы в одном регионе,
	// то срок задачи по представлению заявления о льготе по этим налогам перенесем на самую раннюю дату уплаты аванса (срок по умолчанию - конец года).  
	// Но установить срок задачи непосредственно нельзя - нужно манипулировать значениями СрокМесяцев и СрокДней правила представления заявления.
	// Алгоритм следующий:
	// 1. Находим правило уплаты аванса с самым ранним сроком.
	//    Для этого 
	//		- Находим все периоды (годы), за которые введены записи в регистре по транспортному и земельному налогу (см. временную таблицу Периоды)
	//		- На каждый такой период получаем "срез последних" (см. СрезПоПериодам и СамыеРанниеДатыАванса)
	//      - На основании такого "среза последних" вычисляем минимальную дату аванса в каждом году (СамыеРанниеДатыАванса)
	//        Чтобы не вычислять соотношение между СрокМесяцев и СрокДней, по каждому правилу просто рассчитываем фактический срок уплаты аванса за 1-й квартал.
	// 2. Вычисляем "сдвиг назад" срока из п.1 относительно конца года (СрокМесяцев и СрокДней будут отрицательные). 
	// 3. В целях такого расчета год не важен (берем текущий), т.к. "лишний" день - это 29 февраля. В то же время срок уплаты авансов за 1-й квартал -
	//    не ранее 1 апреля. Таким образом, этот "лишний" день никогда не попадет в интервал между датой уплаты аванса и концом года.
	// 4. СрокМесяцев и СрокДней из п.2 впоследствии будут "подставлены" в правило представления заявления (см. РегистрыСведений.ЗадачиБухгалтера.ЗаполнитьРасписаниеПоНалогамИСборам()).
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ЗемельныйНалог",    "ЗемельныйНалог");
	Запрос.УстановитьПараметр("ТранспортныйНалог", "ТранспортныйНалог");
	Запрос.УстановитьПараметр("ТочкаОтсчета", Дата(Год(ТекущаяДатаСеанса()), 3, 31)); // 31 марта
	Запрос.УстановитьПараметр("КонецГода", КонецГода(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ПравилоЗаявлениеОЛьготеПоТранспортномуЗемельномуНалогу",
		Справочники.ПравилаПредставленияОтчетовУплатыНалогов.НайтиПоИдентификатору("ЛьготыПоТранспортномуЗемельномуНалогу", "2020_Заявление"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Правила.ПериодДействияПравила КАК ПериодДействияПравила
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	ПравилаУплатыАвансов КАК Правила
	|ГДЕ
	|	Правила.Включено
	|	И Правила.Налог.Код В (&ТранспортныйНалог, &ЗемельныйНалог)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.ПериодДействияПравила КАК ПериодДействияПравила,
	|	МАКСИМУМ(Правила.ПериодДействияПравила) КАК ПериодДействующейЗаписи,
	|	Правила.Налог КАК Налог,
	|	Правила.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ СрезПоПериодам
	|ИЗ
	|	Периоды КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПравилаУплатыАвансов КАК Правила
	|		ПО Периоды.ПериодДействияПравила >= Правила.ПериодДействияПравила
	|			И (Правила.Включено)
	|			И (Правила.Налог.Код В (&ТранспортныйНалог, &ЗемельныйНалог))
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.ПериодДействияПравила,
	|	Правила.Налог,
	|	Правила.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоПериодам.ПериодДействияПравила КАК ПериодДействияПравила,
	|	МИНИМУМ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ТочкаОтсчета, МЕСЯЦ, Правила.СрокМесяцев), ДЕНЬ, Правила.СрокДней)) КАК Срок
	|ПОМЕСТИТЬ СамыеРанниеДатыАванса
	|ИЗ
	|	СрезПоПериодам КАК СрезПоПериодам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПравилаУплатыАвансов КАК Правила
	|		ПО СрезПоПериодам.ПериодДействующейЗаписи = Правила.ПериодДействияПравила
	|			И СрезПоПериодам.Налог = Правила.Налог
	|			И СрезПоПериодам.РегистрацияВНалоговомОргане = Правила.РегистрацияВНалоговомОргане
	|ГДЕ
	|	Правила.Включено
	|
	|СГРУППИРОВАТЬ ПО
	|	СрезПоПериодам.ПериодДействияПравила
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПравилоЗаявлениеОЛьготеПоТранспортномуЗемельномуНалогу КАК Правило,
	|	СамыеРанниеДатыАванса.ПериодДействияПравила КАК ПериодДействияПравила,
	|	ИСТИНА КАК Включено,
	|	РАЗНОСТЬДАТ(&КонецГода, СамыеРанниеДатыАванса.Срок, МЕСЯЦ) КАК СрокМесяцев,
	|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(&КонецГода, МЕСЯЦ, РАЗНОСТЬДАТ(&КонецГода, СамыеРанниеДатыАванса.Срок, МЕСЯЦ)), СамыеРанниеДатыАванса.Срок, ДЕНЬ) КАК СрокДней
	|ПОМЕСТИТЬ ПравилаПодачиЗаявленияОЛьготеПоТранспортномуЗемельномуНалогу
	|ИЗ
	|	СамыеРанниеДатыАванса КАК СамыеРанниеДатыАванса";
	
	Запрос.Выполнить();
	
КонецПроцедуры	

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КодыНалоговПорядокКоторыхУстанавливаетсяНаМестах() Экспорт
	
	Налоги = Новый Массив;
	Налоги.Добавить("НалогНаИмущество");
	Налоги.Добавить("ЗемельныйНалог");
	Налоги.Добавить("ТранспортныйНалог");
	// См. также МестныеНалогиВРазрезеНалоговыхОрганов()
	
	Возврат Налоги;
	
КонецФункции

Функция СрокУплатыАвансаЗаКвартал(Запись, НомерКвартала) Экспорт
		
	Если НомерКвартала = 1 Тогда
		КонецКвартала = Дата(Год(Запись.Период), 3, 31);
	ИначеЕсли НомерКвартала = 2 Тогда
		КонецКвартала = Дата(Год(Запись.Период), 6, 30);
	ИначеЕсли НомерКвартала = 3 Тогда
		КонецКвартала = Дата(Год(Запись.Период), 9, 30);
	Иначе
		Возврат '00010101';		
	КонецЕсли;	
	
	РесурсСрокМесяцев = СтрШаблон("СрокУплатыАванса%1КвМесяцев", НомерКвартала);
	РесурсСрокДней = СтрШаблон("СрокУплатыАванса%1КвДней", НомерКвартала);
	День = 24 * 60 * 60;
	
	Возврат КонецМесяца(ДобавитьМесяц(КонецКвартала, Запись[РесурсСрокМесяцев])) + День * Запись[РесурсСрокДней];
	
КонецФункции	

#КонецОбласти

#КонецЕсли
